
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>소개 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="온라인 저지.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="소개.html">
            
                <a href="소개.html">
            
                    
                    소개
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="온라인 저지.html">
            
                <a href="온라인 저지.html">
            
                    
                    온라인 저지
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >소개</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xC18C;&#xAC1C;">&#xC18C;&#xAC1C;</h1>
<p>&#xCD5C;&#xADFC; &#xB4E4;&#xC5B4; &#xD754;&#xD788; Problem Solving, &#xC904;&#xC5EC;&#xC11C; PS&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xBB38;&#xC81C; &#xD480;&#xC774;&#xC5D0; &#xB300;&#xD55C; &#xC0AC;&#xB78C;&#xB4E4;&#xC758; &#xAD00;&#xC2EC;&#xC774; &#xC0C1;&#xB2F9;&#xD788; &#xB9CE;&#xC544;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xB9C8; &#xADFC; &#xBA87; &#xB144; &#xC0AC;&#xC774;&#xC5D0; &#xBD80;&#xCA4D; &#xB9CE;&#xC544;&#xC9C4; &#xB2E4;&#xC591;&#xD55C; &#xAE30;&#xC5C5;&#xC774;&#xB098; &#xB300;&#xD559; &#xC8FC;&#xCD5C;&#xC758; &#xC5EC;&#xB7EC; &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xB300;&#xD68C;&#xB4E4;, &#xD68C;&#xC0AC;&#xC5D0;&#xC11C; &#xCF54;&#xB529; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC810;&#xC810; &#xC911;&#xC694;&#xC2DC; &#xC5EC;&#xAE30;&#xAE30; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xACBD;&#xD5A5; &#xB4F1;&#xC774; &#xC601;&#xD5A5;&#xC744; &#xB07C;&#xCE5C; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB38;&#xC81C;&#xB294; &#xC774; &#xBD84;&#xC57C;&#xB294; &#xC2E4;&#xB825;&#xC744; &#xC313;&#xAE30; &#xC704;&#xD574; &#xC0C1;&#xB2F9;&#xD788; &#xB9CE;&#xC740; &#xC2DC;&#xAC04;&#xC758; &#xACF5;&#xBD80;&#xB97C; &#xC694;&#xAD6C;&#xD558;&#xBA70; &#xC0AC;&#xB78C;&#xB4E4;&#xC758; &#xC2E4;&#xB825; &#xD3B8;&#xCC28;&#xAC00; &#xC5C4;&#xCCAD;&#xB098;&#xAC8C; &#xD070; &#xBD84;&#xC57C;&#xB77C;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC778;&#xD130;&#xB137;&#xC5D0; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xB294; &#xB9AC;&#xC18C;&#xC2A4;&#xB294; &#xAD49;&#xC7A5;&#xD788; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2EC;&#xC9C0;&#xC5B4; &#xC5F0;&#xC2B5;&#xC744; &#xC704;&#xD574; &#xC628;&#xB77C;&#xC778;&#xC73C;&#xB85C; &#xCC38;&#xAC00;&#xD560; &#xC218; &#xC788;&#xB294; &#xB300;&#xD68C;&#xAC00; &#xC77C;&#xC8FC;&#xC77C;&#xC5D0;&#xB3C4; &#xC11C;&#xB108;&#xAC1C;&#xC529; &#xC5F4;&#xB9AC;&#xACE4; &#xD569;&#xB2C8;&#xB2E4;. &#xAC01;&#xC885; &#xC628;&#xB77C;&#xC778; &#xC800;&#xC9C0;&#xC5D0;&#xC11C; &#xD480;&#xC5B4;&#xBCFC; &#xC218; &#xC788;&#xB294; &#xBB38;&#xC81C;&#xB294; &#xBA87; &#xB9CC;&#xAC1C;&#xB97C; &#xB118;&#xC5B4;&#xAC00;&#xC8E0;. &#xBB38;&#xC81C;&#xB97C; &#xD478;&#xB294;&#xB370; &#xD544;&#xC694;&#xD55C; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xC640; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xB4E4;, &#xC5B4;&#xB5BB;&#xAC8C; &#xACF5;&#xBD80;&#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xC124;&#xBA85;&#xD55C; &#xC88B;&#xC740; &#xAE00;&#xB4E4;&#xB3C4; &#xC218;&#xC5C6;&#xC774; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC790;&#xB8CC;&#xAC00; &#xB108;&#xBB34; &#xB9CE;&#xACE0; &#xC0B0;&#xC7AC;&#xD574; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC644;&#xC804;&#xD55C; &#xC785;&#xBB38;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xB3C4;&#xB9AC;&#xC5B4; &#xC5B4;&#xB514;&#xC11C;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD574;&#xC57C; &#xD560;&#xC9C0; &#xD63C;&#xB780;&#xC2A4;&#xB7FD;&#xAC8C; &#xB290;&#xAEF4;&#xC9C0;&#xACE4; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774; &#xC790;&#xB8CC;&#xB294; &#xADF8;&#xB7F0; &#xC644;&#xC804;&#xD55C; &#xCD08;&#xBCF4;&#xC790; &#xBD84;&#xB4E4;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xC788;&#xB294; &#xBB38;&#xC81C; &#xD480;&#xC774;&#xC5D0; &#xAD00;&#xD55C; &#xC790;&#xB8CC;&#xB4E4;&#xC740; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xACFC; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xC5D0; &#xBC31;&#xADF8;&#xB77C;&#xC6B4;&#xB4DC;&#xAC00; &#xC788;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xC4F0;&#xC5EC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xC815;&#xB9D0; &#xC88B;&#xC740; &#xC790;&#xB8CC;&#xB85C; &#xCD94;&#xCC9C;&#xBC1B;&#xACE4; &#xD558;&#xB294; <strong>&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xB300;&#xD68C;&#xC5D0;&#xC11C; &#xBC30;&#xC6B0;&#xB294; &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xBB38;&#xC81C; &#xD574;&#xACB0; &#xC804;&#xB7B5;</strong>, &#xD754;&#xD788; &#xC800;&#xC790;&#xBD84;&#xC758; &#xC774;&#xB984;&#xC744; &#xB530;&#xC11C; &#xC885;&#xB9CC;&#xBD81;&#xC73C;&#xB85C; &#xBD88;&#xB9AC;&#xB294; &#xC774; &#xCC45;&#xC740; &#xBD84;&#xBA85; &#xC544;&#xC8FC;&#xC544;&#xC8FC; &#xC88B;&#xC740; &#xCC45;&#xC774;&#xC9C0;&#xB9CC; &#xCD08;&#xBCF4;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xC0C1;&#xB2F9;&#xD788; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xC788;&#xB294; &#xCC45;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC790;&#xB8CC;&#xB294; &#xC774;&#xB7F0; PS&#xC5D0; &#xAD00;&#xD55C; &#xC11C;&#xC801; &#xBC0F; &#xC778;&#xD130;&#xB137; &#xBE14;&#xB85C;&#xADF8; &#xB4F1;&#xC5D0; &#xC788;&#xB294; &#xADF8; &#xC5B4;&#xB5A4; &#xC790;&#xB8CC;&#xBCF4;&#xB2E4;&#xB3C4; &#xB354; &#xC27D;&#xACE0; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xB0B4;&#xC6A9;&#xBD80;&#xD130; &#xB2E4;&#xB8E8;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC880; &#xB354; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xD558;&#xC790;&#xBA74; &#xC774; &#xC790;&#xB8CC;&#xB294; &#xC544;&#xB798; &#xC815;&#xB3C4;&#xC758; &#xC9C0;&#xC2DD;&#xACFC; &#xB2A5;&#xB825;, &#xBAA9;&#xC801;&#xC744; &#xAC16;&#xACE0; &#xC788;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC791;&#xC131;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xD559;&#xAD50;&#xC5D0;&#xC11C; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4; &#xC218;&#xC5C5;&#xC740; &#xBC30;&#xC6E0;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;/&#xC2E4;&#xD589;&#xD560; &#xC904;&#xC740; &#xC544;&#xB294;&#xB370; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC9DC;&#xB77C;&#xACE0; &#xD558;&#xBA74; &#xC798; &#xBABB; &#xC9DC;&#xACA0;&#xB2E4;(ex - &#xBCC4;&#xB85C; &#xC0BC;&#xAC01;&#xD615; &#xADF8;&#xB9AC;&#xAE30; &#xB4F1;&#xC758; &#xACFC;&#xC81C;&#xB3C4; &#xD574;&#xACB0;&#xD558;&#xAE30;&#xAC00; &#xC27D;&#xC9C0; &#xC54A;&#xB2E4;).</li>
<li>&#xC54C;&#xACE0;&#xB9AC;&#xC998;, &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xAC00; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xACE0; &#xD574;&#xC11C; &#xACF5;&#xBD80;&#xB294; &#xD558;&#xACE0; &#xC2F6;&#xC740;&#xB370; &#xBB50;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD574;&#xC57C; &#xD560; &#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xACE0; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xC788;&#xB294; &#xC790;&#xB8CC;&#xAC74; &#xCC45;&#xC774;&#xAC74; &#xB108;&#xBB34; &#xC5B4;&#xB824;&#xC6CC;&#xC11C; &#xC2DC;&#xC791;&#xD560; &#xC5C4;&#xB450;&#xAC00; &#xC548; &#xB09C;&#xB2E4;.</li>
</ul>
<p>&#xC774; &#xC790;&#xB8CC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC704;&#xC640; &#xAC19;&#xC740; &#xBD84;&#xB4E4;&#xC774; &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xBB38;&#xC81C; &#xD574;&#xACB0; &#xBD84;&#xC57C;&#xC5D0; &#xD765;&#xBBF8;&#xB97C; &#xAC16;&#xACE0; &#xAFB8;&#xC900;&#xD788; &#xACF5;&#xBD80;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC73C;&#xBA74; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xAD6C;&#xC131;">&#xAD6C;&#xC131;</h2>
<p>&#xAC01; &#xCC55;&#xD130;&#xB294; &#xD574;&#xB2F9; &#xCC55;&#xD130;&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC124;&#xBA85; &#xBC0F; 20~30 &#xBB38;&#xC81C; &#xC815;&#xB3C4;&#xC758; &#xC5F0;&#xC2B5; &#xBB38;&#xC81C;&#xC640; &#xADF8; &#xD480;&#xC774; &#xCF54;&#xB4DC; &#xBC0F; &#xD480;&#xC774; &#xC124;&#xBA85;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5F0;&#xC2B5; &#xBB38;&#xC81C;&#xAC00; &#xAD49;&#xC7A5;&#xD788; &#xB9CE;&#xC740;&#xB370; &#xC774; &#xBB38;&#xC81C;&#xB4E4;&#xC740; &#xAF2D; &#xD480;&#xC5B4;&#xBCF4;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xAE30;&#xB97C; &#xAD8C;&#xD569;&#xB2C8;&#xB2E4;. PS &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xBAA8;&#xB4E0; &#xB6F0;&#xC5B4;&#xB09C; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC2E4;&#xB825;&#xC744; &#xD0A4;&#xC6B0;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; <strong>&#xB9CE;&#xC740; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;</strong> &#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD560; &#xB9CC;&#xD07C; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC2DC; &#xD55C; &#xBC88; &#xAC15;&#xC870;&#xD569;&#xB2C8;&#xB2E4;. <strong>&#xBC18;&#xB4DC;&#xC2DC; &#xBAA8;&#xB4E0; &#xC5F0;&#xC2B5; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xACE0; &#xB118;&#xC5B4;&#xAC00; &#xC8FC;&#xC138;&#xC694;</strong>.</p>
<p>&#xCD94;&#xAC00;&#xB85C;, &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xB2E4; &#xBCF4;&#xBA74; &#xBB38;&#xC81C;&#xAC00; &#xC815;&#xB9D0; &#xC548; &#xD480;&#xB9B4; &#xB54C;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; &#xBA70;&#xCE60;&#xC774;&#xACE0; &#xD480;&#xB9B4; &#xB54C;&#xAE4C;&#xC9C0; &#xADF8; &#xBB38;&#xC81C;&#xB97C; &#xBD99;&#xC7A1;&#xACE0; &#xC788;&#xC744; &#xC218;&#xB3C4;, &#xC801;&#xB2F9;&#xD788; &#xACE0;&#xBBFC;&#xD558;&#xB2E4;&#xAC00; &#xD480;&#xC774;&#xB97C; &#xBCFC; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xAC00; &#xC548; &#xD480;&#xB9B4; &#xB54C; &#xD480;&#xC774;&#xB97C; &#xC5B8;&#xC81C;&#xCBE4; &#xBCF4;&#xB294;&#xAC8C; &#xC88B;&#xB2E4;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC758;&#xACAC;&#xC774; &#xC788;&#xACE0; &#xC774;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xC815;&#xB2F5;&#xC774; &#xC5C6;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xCD08;&#xBCF4;&#xC77C; &#xB54C;&#xB294; &#xC9C0;&#xC2DD;&#xC801;&#xC778; &#xBA74;&#xC774;&#xB4E0; &#xD14C;&#xD06C;&#xB2C9;&#xC801;&#xC778; &#xBA74;&#xC774;&#xB4E0; &#xB9CE;&#xC774; &#xBD80;&#xC871;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; 2~30&#xBD84; &#xC815;&#xB3C4; &#xACE0;&#xBBFC;&#xD574;&#xB3C4; &#xBB38;&#xC81C;&#xAC00; &#xC548; &#xD480;&#xB9AC;&#xBA74; &#xD480;&#xC774;&#xB97C; &#xBCF4;&#xACE0; &#xBE68;&#xB9AC; &#xC9C0;&#xC2DD;&#xC744; &#xC313;&#xB294; &#xAC8C; &#xC88B;&#xB2E4;&#xACE0; &#xBD05;&#xB2C8;&#xB2E4;. &#xC880; &#xB354; &#xC2E4;&#xB825;&#xC774; &#xC313;&#xC774;&#xACE0; &#xB098;&#xBA74; &#xAE4A;&#xC774; &#xC788;&#xAC8C; &#xC0AC;&#xACE0;&#xD558;&#xB294; &#xB2A5;&#xB825;&#xC744; &#xD0A4;&#xC6B0;&#xB294; &#xAC83;&#xB3C4; &#xC911;&#xC694;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC798; &#xC548;&#xD480;&#xB9AC;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xAE38;&#xAC8C; &#xBD99;&#xC7A1;&#xACE0; &#xD480;&#xC5B4;&#xBCF4;&#xB294; &#xAC83;&#xB3C4; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; &#xD55C; &#xAC00;&#xC9C0; &#xC911;&#xC694;&#xD55C; &#xAC74; &#xD480;&#xC774;&#xB97C; &#xBCF4;&#xACE0; &#xC774;&#xD574;&#xD588;&#xB2E4;&#xACE0; &#xD574;&#xC11C; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC9C0; &#xC54A;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xC11C;&#xB294; &#xC548; &#xB41C;&#xB2E4;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;. &#xD480;&#xC774;&#xB97C; &#xC77D;&#xC5C8;&#xC5B4;&#xB3C4; <strong>&#xAF2D; &#xADF8; &#xBB38;&#xC81C;&#xB97C; &#xC9C1;&#xC811; &#xCF54;&#xB529;&#xD574;&#xC11C; &#xC815;&#xB2F5;&#xC744; &#xB9DE;&#xACE0; &#xB118;&#xC5B4;&#xAC00; &#xC8FC;&#xC138;&#xC694;</strong>. &#xC774; &#xAC83; &#xC5ED;&#xC2DC; &#xC815;&#xB9D0; &#xC911;&#xC694;&#xD55C; &#xC694;&#xC18C;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB824;&#xC6B4; &#xBB38;&#xC81C;&#xC77C; &#xC218;&#xB85D; &#xD480;&#xC774;&#xB97C; &#xC54C;&#xC544;&#xB3C4; &#xAD6C;&#xD604;&#xD558;&#xAE30; &#xD798;&#xB4E0; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xACE0;, &#xC2E4;&#xC81C;&#xB85C; &#xAD6C;&#xD604;&#xD574;&#xBCF4;&#xBA74; &#xB0B4;&#xAC00; &#xD480;&#xC774;&#xB97C; &#xC77D;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83;&#xACFC;&#xB294; &#xC880; &#xB2E4;&#xB978; &#xBD80;&#xBD84;&#xB4E4;&#xC774; &#xC788;&#xAE30; &#xB9C8;&#xB828;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xBD80;&#xBD84;&#xB4E4;&#xC744; &#xC9C1;&#xC811; &#xB2E4; &#xAD6C;&#xD604;&#xD574;&#xBCF4;&#xACE0; &#xD655;&#xC2E4;&#xD788; &#xAE68;&#xC6B0;&#xCE58;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xC57C; &#xB098;&#xC911;&#xC5D0; &#xBE44;&#xC2B7;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB0AC;&#xC744; &#xB54C;&#xB3C4; &#xD574;&#xACB0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC5B8;&#xC5B4;&#xC5D0;-&#xAD00;&#xD558;&#xC5EC;">&#xC5B8;&#xC5B4;&#xC5D0; &#xAD00;&#xD558;&#xC5EC;</h2>
<p>&#xB300;&#xBD80;&#xBD84;&#xC758; PS&#xC640; &#xAD00;&#xB828;&#xB41C; &#xC790;&#xB8CC;&#xB294; C++&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xAC00;&#xC815;&#xD558;&#xACE0; &#xC791;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. C++&#xAC00; &#xC544;&#xBB34;&#xB798;&#xB3C4; &#xC131;&#xB2A5;&#xC774; &#xC555;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xB6F0;&#xC5B4;&#xB098;&#xACE0; PS&#xC5D0;&#xC11C; &#xC4F0;&#xAE30; &#xC88B;&#xC740; &#xD2B9;&#xC131;&#xC744; &#xB9CE;&#xC774; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC544;&#xBB34;&#xB798;&#xB3C4; C++&#xC774; &#xC8FC;&#xB825; &#xC5B8;&#xC5B4;&#xAC00; &#xC544;&#xB2CC; &#xC0AC;&#xB78C;&#xC758; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xC774; &#xC5B8;&#xC5B4; &#xD558;&#xB098;&#xB9CC;&#xC73C;&#xB85C;&#xB3C4; &#xACF5;&#xBD80;&#xD558;&#xB294;&#xB370; &#xD070; &#xC7A5;&#xBCBD;&#xC774; &#xB418;&#xACE0;&#xB294; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC790;&#xB8CC;&#xB97C; &#xC791;&#xC131;&#xD55C; &#xC0AC;&#xB78C; &#xC5ED;&#xC2DC;&#xB3C4; &#xC8FC;&#xB825; &#xC5B8;&#xC5B4;&#xAC00; C++&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7F0; &#xBD80;&#xBD84;&#xC5D0;&#xC11C;&#xB294; &#xBC97;&#xC5B4; &#xB0A0; &#xC218;&#xAC00; &#xC5C6;&#xACE0;, &#xC5B4;&#xCA54; &#xC218; &#xC5C6;&#xC774; C++&#xC744; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xC790;&#xB8CC;&#xB97C; &#xC791;&#xC131;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC; &#xB418;&#xB3C4;&#xB85D; &#xBAA8;&#xB4E0; &#xC5F0;&#xC2B5; &#xBB38;&#xC81C;&#xC758; &#xB2F5;&#xC548;&#xACFC; &#xCF54;&#xB4DC;&#xC5D0; &#xAD00;&#xD55C; &#xC124;&#xBA85;&#xC744; &#xCD5C;&#xC18C;&#xD55C; &#xC81C;&#xAC00; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xC54C;&#xACE0; &#xC788;&#xC73C;&#xBA74;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC5B8;&#xC5B4;&#xC778; python&#xC73C;&#xB85C;&#xB3C4; &#xC124;&#xBA85;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB178;&#xB825;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xBA74; Java&#xB85C;&#xB3C4; &#xC18C;&#xAC1C;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xC9C0;&#xB9CC; &#xC790;&#xBC14;&#xC758; &#xACBD;&#xC6B0; &#xC81C; &#xB2A5;&#xB825;&#xC774; &#xBD80;&#xC871;&#xD574;&#xC11C; &#xC791;&#xC131;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCCA8;&#xBD80;&#xB41C; &#xC5F0;&#xC2B5; &#xBB38;&#xC81C;&#xC5D0; &#xB300;&#xD574; Java &#xC608;&#xC2DC; &#xCF54;&#xB4DC; &#xBC0F; &#xC124;&#xBA85;&#xC744; &#xC791;&#xC131;&#xD574; &#xC8FC;&#xC2E4; &#xC218; &#xC788;&#xB294; &#xBD84;&#xC774; &#xACC4;&#xC2DC;&#xB2E4;&#xBA74; &#xC5B8;&#xC81C;&#xB4E0;&#xC9C0; &#xAD00;&#xB828; &#xB0B4;&#xC6A9;&#xC744; Pull request&#xB85C; &#xBCF4;&#xB0B4;&#xC8FC;&#xC2DC;&#xBA74; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xBC18;&#xC601;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC640; &#xBCC4;&#xAC1C;&#xB85C;, PS&#xC758; &#xACBD;&#xC6B0; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xBCF4;&#xBA74; &#xC5B4;&#xCA54; &#xC218; &#xC5C6;&#xC774; C++ &#xC678;&#xC758; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB4E4;&#xC740; &#xC190;&#xD574;&#xB97C; &#xBCF4;&#xAC8C; &#xB418;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC591;&#xD55C; &#xC5B8;&#xC5B4;&#xB97C; &#xBC30;&#xC6B0;&#xB294; &#xAC83; &#xC790;&#xCCB4;&#xB3C4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xC5D0;&#xAC8C; &#xB9CE;&#xC740; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xB294; &#xC77C;&#xC774;&#xBA70; PS&#xC758; &#xACBD;&#xC6B0; &#xC5B8;&#xC5B4; &#xC790;&#xCCB4;&#xC5D0; &#xAD00;&#xD55C; &#xC9C0;&#xC2DD;&#xC744; &#xADF8;&#xB807;&#xAC8C; &#xD06C;&#xAC8C; &#xC694;&#xAD6C;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC5B8;&#xC5B4; &#xD559;&#xC2B5;&#xC6A9;&#xC73C;&#xB85C; &#xD6CC;&#xB96D;&#xD55C; &#xC218;&#xB2E8;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; PS&#xB97C; &#xAE4A;&#xC774; &#xC788;&#xAC8C; &#xACF5;&#xBD80;&#xD560; &#xC0DD;&#xAC01;&#xC774; &#xC788;&#xC73C;&#xC2DC;&#xB2E4;&#xBA74;, &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xBA70; C++&#xC744; &#xAC19;&#xC774; &#xBC30;&#xC6CC; &#xB098;&#xAC00;&#xC2DC;&#xB294; &#xAC83;&#xC744; &#xAC15;&#xB825;&#xD558;&#xAC8C; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="온라인 저지.html" class="navigation navigation-next " aria-label="Next page: 온라인 저지">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"소개","level":"1.2","depth":1,"next":{"title":"온라인 저지","level":"1.2.1","depth":2,"path":"posts/온라인 저지.md","ref":"posts/온라인 저지.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["mathjax","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"mathjax":{"forceSVG":false,"version":"2.6-latest"},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"gitbook":"*"},"file":{"path":"posts/소개.md","mtime":"2018-11-04T14:48:58.583Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-11-04T13:58:35.965Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

