
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>온라인 저지 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-collapse/collapse.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="소개.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="소개.html">
            
                <a href="소개.html">
            
                    
                    소개
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="온라인 저지.html">
            
                <a href="온라인 저지.html">
            
                    
                    온라인 저지
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >온라인 저지</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xC628;&#xB77C;&#xC778;-&#xC800;&#xC9C0;">&#xC628;&#xB77C;&#xC778; &#xC800;&#xC9C0;</h1>
<p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; PS &#xACF5;&#xBD80;&#xB97C; &#xD560; &#xB54C;&#xB294; &#xAC01;&#xC885; &#xC628;&#xB77C;&#xC778; &#xC800;&#xC9C0; &#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xC774;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC0AC;&#xC774;&#xD2B8;&#xB4E4;&#xC740; &#xB0B4;&#xAC00; &#xBB38;&#xC81C;&#xB97C; &#xD47C; &#xC18C;&#xC2A4;&#xB97C; &#xC81C;&#xCD9C;&#xD558;&#xBA74; &#xADF8; &#xC18C;&#xC2A4;&#xAC00; &#xB9DE;&#xB294;&#xC9C0; &#xCC44;&#xC810;&#xC744; &#xD574;&#xC8FC;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xACF5;&#xBD80;&#xD558;&#xB294;&#xB370; &#xAD49;&#xC7A5;&#xD788; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xCC44;&#xC810;&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xD45C;&#xC900; &#xC785;&#xCD9C;&#xB825;(standard input output)&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xD45C;&#xC900; &#xC785;&#xCD9C;&#xB825;&#xC740; C++&#xC758; &#xACBD;&#xC6B0; scanf/printf, python&#xC758; &#xACBD;&#xC6B0; input/print&#xC640; &#xAC19;&#xC774; &#xC6B0;&#xB9AC;&#xAC00; &#xD754;&#xD788; &#xCF58;&#xC194; &#xCC3D;&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xD654;&#xBA74;&#xC5D0;&#xC11C; &#xC785;&#xB825;&#xD558;&#xACE0; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC790;&#xB8CC;&#xB294; &#xAD6D;&#xB0B4;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xB2E4;&#xC591;&#xD55C; &#xC5B8;&#xC5B4;&#xC640; &#xBB38;&#xC81C;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; <a href="https://acmicpc.net" target="_blank">&#xBC31;&#xC900; &#xC628;&#xB77C;&#xC778; &#xC800;&#xC9C0;(BOJ)</a>&#xC758; &#xBB38;&#xC81C;&#xB4E4;&#xC744; &#xC5F0;&#xC2B5; &#xBB38;&#xC81C;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC628;&#xB77C;&#xC778; &#xC800;&#xC9C0;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBCF8; &#xC801; &#xC5C6;&#xB294; &#xBD84;&#xB4E4;&#xC744; &#xC704;&#xD574;, &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC2DC; &#xBB38;&#xC81C;&#xB97C; &#xD558;&#xB098; &#xD480;&#xACE0; &#xB118;&#xC5B4;&#xAC00; &#xBD05;&#xC2DC;&#xB2E4;. &#xC704; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xAC00;&#xC785;&#xD574;&#xC11C; &#xC9C1;&#xC811; &#xC544;&#xB798; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xBCF4;&#xC138;&#xC694;.</p>
<h2 id="2557-hello-world">2557. Hello, World</h2>
<p><a href="https://www.acmicpc.net/problem/2557" target="_blank">&#xBB38;&#xC81C; &#xB9C1;&#xD06C;</a></p>
<p>&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC218;&#xC5C5; &#xB4F1;&#xC5D0;&#xC11C; &#xBCF4;&#xD1B5; &#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; Hello World!&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB38;&#xC81C; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC790;&#xC138;&#xD788; &#xBCF4;&#xBA74;, &#xC544;&#xB798;&#xC758; &#xBA87; &#xAC00;&#xC9C0; &#xC694;&#xC18C;&#xB4E4;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xC608;&#xC2DC; &#xC785;&#xCD9C;&#xB825;</li>
<li>&#xC2DC;&#xAC04; &#xC81C;&#xD55C;</li>
<li>&#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;</li>
</ul>
<h3 id="&#xC608;&#xC2DC;-&#xC785;&#xCD9C;&#xB825;">&#xC608;&#xC2DC; &#xC785;&#xCD9C;&#xB825;</h3>
<p>&#xC608;&#xC2DC; &#xC785;&#xCD9C;&#xB825;&#xC740; &#xBB38;&#xC81C;&#xC758; &#xC785;&#xB825;&#xACFC; &#xCD9C;&#xB825; &#xD3EC;&#xB9F7; &#xD655;&#xC778; &#xBC0F; &#xBB38;&#xC81C;&#xC758; &#xC774;&#xD574;&#xB97C; &#xB3D5;&#xAE30; &#xC704;&#xD574; &#xC8FC;&#xC5B4;&#xC9C0;&#xB294; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;. &#xB0B4;&#xAC00; &#xC791;&#xC131;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC774; &#xC608;&#xC2DC;&#xC5D0; &#xC788;&#xB294; &#xC785;&#xB825;&#xC744; &#xCF58;&#xC194; &#xCC3D;&#xC73C;&#xB85C;&#xBD80;&#xD130;(&#xD45C;&#xC900; &#xC785;&#xCD9C;&#xB825;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC;) &#xC785;&#xB825; &#xBC1B;&#xC544;&#xC11C; &#xC8FC;&#xC5B4;&#xC9C4; &#xC608;&#xC2DC;&#xC5D0; &#xC788;&#xB294; &#xAC83;&#xACFC; <strong>&#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xB3D9;&#xC77C;&#xD55C; &#xCD9C;&#xB825;</strong>&#xC744; &#xB0B4;&#xC57C; &#xC815;&#xB2F5;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC810;&#xC774; &#xC911;&#xC694;&#xD55C;&#xB370;, &#xBB38;&#xC81C;&#xC758; &#xB2F5;&#xACFC; &#xC870;&#xAE08;&#xC774;&#xB77C;&#xB3C4; &#xB2E4;&#xB978; &#xCD9C;&#xB825;&#xC744; &#xB0B4;&#xBA74; &#xC624;&#xB2F5;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC989;, <code>Hello World!</code> &#xB300;&#xC2E0;&#xC5D0; <code>Hello World</code>&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xAC70;&#xB098; <code>hello world!</code>&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xAC70;&#xB098; <code>Hello, World!</code>&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xBA74; &#xC804;&#xBD80; &#xC624;&#xB2F5;&#xC73C;&#xB85C; &#xCDE8;&#xAE09;&#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC870;&#xAE08;&#xC758; &#xC2E4;&#xC218;&#xB3C4; &#xD5C8;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC740; &#xB0B4;&#xAC00; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD588;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xCC44;&#xC810;&#xC744; &#xC0AC;&#xB78C;&#xC774; &#xC9C1;&#xC811;&#xD558;&#xB294; &#xAC8C; &#xC544;&#xB2C8;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC628;&#xB77C;&#xC778; &#xC800;&#xC9C0; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C;&#xC758; &#xCC44;&#xC810;&#xC740; &#xBBF8;&#xB9AC; &#xD574;&#xB2F9; &#xBB38;&#xC81C;&#xC5D0; &#xB300;&#xD55C; <em>&#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;</em>, &#xADF8;&#xB7EC;&#xB2C8;&#xAE4C; &#xCC44;&#xC810;&#xC744; &#xC704;&#xD55C; &#xC785;&#xB825; &#xD30C;&#xC77C;&#xACFC; &#xAC70;&#xAE30;&#xC5D0; &#xB300;&#xC751;&#xB418;&#xB294; &#xCD9C;&#xB825; &#xD30C;&#xC77C;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xCEF4;&#xD4E8;&#xD130;&#xB294; &#xC790;&#xC2E0;&#xC774; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xC758; &#xC785;&#xB825;&#xC744; &#xC6B0;&#xB9AC;&#xAC00; &#xC791;&#xC131;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB300;&#xC785;&#xD558;&#xACE0;, &#xADF8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4; &#xB0B8; &#xCD9C;&#xB825;&#xC744; &#xB2E4;&#xC2DC; &#xC790;&#xC2E0;&#xC774; &#xAC16;&#xACE0; &#xC788;&#xB294; &#xCD9C;&#xB825; &#xD30C;&#xC77C;&#xACFC; &#xBE44;&#xAD50;&#xD569;&#xB2C8;&#xB2E4;. &#xB0B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB0B8; &#xCD9C;&#xB825;&#xACFC; &#xC774; &#xCD9C;&#xB825; &#xD30C;&#xC77C;&#xC758; &#xB0B4;&#xC6A9;&#xC774; &#xC644;&#xBCBD;&#xD788; &#xAC19;&#xC73C;&#xBA74; &#xC815;&#xB2F5;&#xC73C;&#xB85C; &#xCDE8;&#xAE09;&#xD558;&#xACE0;, &#xC544;&#xB2C8;&#xBA74; &#xC624;&#xB2F5;&#xC73C;&#xB85C; &#xCDE8;&#xAE09;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;, &#xC0AC;&#xC774;&#xD2B8;&#xB9C8;&#xB2E4; &#xC870;&#xAE08;&#xC529; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xAE34; &#xD558;&#xC9C0;&#xB9CC; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB294; &#xACF5;&#xAC1C;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB0B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBB34;&#xC5C7; &#xB54C;&#xBB38;&#xC5D0; &#xD2C0;&#xB838;&#xB294;&#xC9C0; &#xAC00;&#xB974;&#xCCD0; &#xC8FC;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xAC8C; &#xB2F5;&#xB2F5;&#xD558;&#xAC8C; &#xB290;&#xAEF4;&#xC9C8; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC;, &#xB0B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xBC84;&#xADF8;&#xB97C; &#xC7A1;&#xC544;&#xB0B4;&#xB294; &#xAC83; &#xC5ED;&#xC2DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C; &#xAD49;&#xC7A5;&#xD788; &#xC911;&#xC694;&#xD55C; &#xB2A5;&#xB825;&#xC785;&#xB2C8;&#xB2E4;. &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xACBD;&#xC6B0; &#xC774;&#xB7F0; &#xB514;&#xBC84;&#xAE45; &#xB2A5;&#xB825;&#xC744; &#xD0A4;&#xC6B0;&#xAE30;&#xAC00; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;. &#xB0B4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xBC18;&#xB840;&#xB97C; &#xC9C1;&#xC811; &#xC0DD;&#xAC01;&#xD574;&#xB0B4;&#xC9C0; &#xC54A;&#xACE0; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xBCF4;&#xACE0; &#xBC18;&#xB840;&#xB97C; &#xCC3E;&#xAC8C; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC880; &#xB2F5;&#xB2F5;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xB2E4;&#xC591;&#xD55C; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC9C1;&#xC811; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xACE0;, &#xCF54;&#xB4DC;&#xB97C; &#xAF3C;&#xAF3C;&#xD788; &#xC77D;&#xC73C;&#xBA74;&#xC11C; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xB294; &#xC2B5;&#xAD00;&#xC744; &#xD0A4;&#xC6B0;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB514;&#xBC84;&#xAE45;&#xC740; &#xC911;&#xC694;&#xD55C; &#xB0B4;&#xC6A9;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB098;&#xC911;&#xC5D0; &#xB2E4;&#xC2DC; &#xD55C; &#xBC88; &#xAE4A;&#xC774; &#xC788;&#xAC8C; &#xB2E4;&#xB8E8;&#xAC8C; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC2DC;&#xAC04;-&#xC81C;&#xD55C;">&#xC2DC;&#xAC04; &#xC81C;&#xD55C;</h3>
<p>&#xBB38;&#xC81C;&#xB4E4;&#xB9C8;&#xB2E4; &#xBCF4;&#xD1B5; &#xC2DC;&#xAC04;&#xC81C;&#xD55C;&#xC774; 1&#xCD08; &#xC815;&#xB3C4;&#xC5D0;&#xC11C; &#xAE34; &#xAC83;&#xC740; 4~5&#xCD08;&#xAE4C;&#xC9C0; &#xC8FC;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC2DC;&#xAC04; &#xC81C;&#xD55C;&#xC740; &#xBB38;&#xC81C;&#xB97C; &#xADF8; &#xC2DC;&#xAC04; &#xC548;&#xC5D0; &#xD480;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC774; &#xC544;&#xB2C8;&#xB77C;, &#xB0B4;&#xAC00; &#xC9E0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC8FC;&#xC5B4;&#xC9C4; &#xC2DC;&#xAC04; &#xC81C;&#xD55C; &#xC548;&#xC5D0; &#xC8FC;&#xC5B4;&#xC9C4; &#xC785;&#xB825;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xB2F5;&#xC744; &#xCD9C;&#xB825;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xC2DC;&#xAC04;&#xC774; &#xC8FC;&#xC5B4;&#xC9C4; &#xC2DC;&#xAC04; &#xC81C;&#xD55C;&#xC744; &#xB118;&#xC73C;&#xBA74; &#xC548; &#xB41C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB294; &#xD754;&#xD788; &#xC2DC;&#xAC04; &#xBCF5;&#xC7A1;&#xB3C4;&#xB77C;&#xACE0; &#xBD88;&#xB9AC;&#xB294; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xD6A8;&#xC728;&#xC131;&#xC744; &#xBCF4;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC8FC;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xAC19;&#xC740; &#xBB38;&#xC81C;&#xB77C;&#xB3C4; &#xD478;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB530;&#xB77C; &#xB2F5;&#xC744; &#xAD6C;&#xD558;&#xB294;&#xB370; 0.001&#xCD08;&#xB3C4; &#xC548; &#xAC78;&#xB9AC;&#xB294; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xC788;&#xACE0;, &#xD55C;&#xC2DC;&#xAC04; &#xB450;&#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB098;&#xB3C4; &#xB2F5;&#xC744; &#xAD6C;&#xD560; &#xC218; &#xC5C6;&#xB290; &#xC548;&#xACE8;&#xB9AC;&#xC998;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC2DC;&#xAC04; &#xC81C;&#xD55C;&#xC740; &#xBB38;&#xC81C;&#xB97C; &#xB9CC;&#xB4E0; &#xC0AC;&#xB78C;&#xC774; &#xC758;&#xB3C4;&#xD55C; &#xC218;&#xC900;&#xC758; &#xD6A8;&#xC728;&#xC131;&#xC744; &#xAC00;&#xC9C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB9CC;&#xC774; &#xC815;&#xB2F5;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574; &#xC8FC;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC62C;&#xBC14;&#xB978; &#xB2F5;&#xC744; &#xB0B4;&#xB354;&#xB77C;&#xB3C4; &#xC2DC;&#xAC04; &#xC81C;&#xD55C;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC815;&#xB2F5; &#xB300;&#xC2E0; &#xC2DC;&#xAC04; &#xCD08;&#xACFC;(Time Limit Exceeded, TLE)&#xB97C; &#xBC1B;&#xACE0; &#xD2C0;&#xB9AC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xBA54;&#xBAA8;&#xB9AC;-&#xC81C;&#xD55C;">&#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;</h3>
<p>&#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;&#xC740; &#xC8FC;&#xC5B4;&#xC9C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC81C;&#xD55C; &#xC548;&#xCABD;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xB9CC;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xB3D9;&#xC791;&#xD574;&#xC57C;&#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xD2B9;&#xC218;&#xD55C; &#xBB38;&#xC81C;&#xB4E4;&#xC744; &#xC81C;&#xC678;&#xD558;&#xACE0;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;&#xC744; &#xC2E0;&#xACBD;&#xC368;&#xC57C; &#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB294; &#xC798; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788;&#xB098; &#xC26C;&#xC6B4; &#xBB38;&#xC81C;&#xB4E4;&#xC740; &#xB531;&#xD788; &#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;&#xC744; &#xC2E0;&#xACBD; &#xC4F8; &#xD544;&#xC694;&#xB294; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xB2F9;&#xC7A5;&#xC740; &#xBCC4;&#xB85C; &#xC2E0;&#xACBD;&#xC4F0;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;. &#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;&#xC744; &#xC2E0;&#xACBD; &#xC368;&#xC57C; &#xD558;&#xB294; &#xBB38;&#xC81C;&#xB4E4; &#xC5ED;&#xC2DC; &#xB098;&#xC911;&#xC5D0; &#xB2E4;&#xB8E8;&#xAC8C; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xADF8; &#xBB38;&#xC81C;&#xB4E4;&#xC744; &#xD480; &#xB54C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xAD00;&#xD55C; &#xAC83;&#xC744; &#xC790;&#xC138;&#xD788; &#xBC30;&#xC6CC; &#xBD05;&#xC2DC;&#xB2E4;. &#xBA54;&#xBAA8;&#xB9AC; &#xC81C;&#xD55C;&#xC744; &#xB118;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC5ED;&#xC2DC; &#xC815;&#xB2F5; &#xB300;&#xC2E0; &#xBA54;&#xBAA8;&#xB9AC; &#xCD08;&#xACFC;(Memory Limit Exceeded, MLE)&#xB97C; &#xBC1B;&#xACE0; &#xD2C0;&#xB9AC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xD480;&#xC774;">&#xD480;&#xC774;</h3>
<p>&#xC774;&#xC81C; &#xC2E4;&#xC81C;&#xB85C; &#xC774; &#xBB38;&#xC81C;&#xC758; &#xD480;&#xC774;&#xB97C; &#xC791;&#xC131;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;. &#xC774; &#xBB38;&#xC81C;&#xB294; &#xB2E8;&#xC21C;&#xD788; &#xC8FC;&#xC5B4;&#xC9C4; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xCF58;&#xC194; &#xCC3D;&#xC5D0; &#xCD9C;&#xB825;&#xD558;&#xBA74; &#xD480;&#xB9AC;&#xB294; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xC790;&#xAE30;&#xAC00; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC5B8;&#xC5B4;&#xC758; &#xCD9C;&#xB825; &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; Hello World!&#xB97C; &#xCD9C;&#xB825;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p>
<p><details><summary>C++</summary><pre><code class="lang-C++"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span>
</span>{
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Hello World!&quot;</span>);
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
<p>&#xD639;&#xC740;, printf &#xB300;&#xC2E0;&#xC5D0; C++&#xC758; &#xCD9C;&#xB825; &#xD568;&#xC218;&#xC778; cout&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-C++"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;iostream&gt;</span></span>

<span class="hljs-keyword">using</span> <span class="hljs-keyword">namespace</span> <span class="hljs-built_in">std</span>;

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span>
</span>{
    <span class="hljs-built_in">cout</span> &lt;&lt; <span class="hljs-string">&quot;Hello World!&quot;</span>;
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
}
</code></pre>
</details></p>
<p><details><summary>python</summary><pre><code class="lang-python">print(<span class="hljs-string">&quot;Hello World!&quot;</span>)
</code></pre>
</details></p>
<p>&#xCF54;&#xB4DC;&#xB97C; &#xBAA8;&#xB450; &#xC791;&#xC131;&#xD588;&#xB2E4;&#xBA74; &#xBB38;&#xC81C; &#xC0C1;&#xB2E8;&#xC758; <strong>&#xC81C;&#xCD9C;</strong> &#xBC84;&#xD2BC;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC81C;&#xCD9C;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC81C;&#xCD9C;&#xD55C; &#xCF54;&#xB4DC;&#xB294; &#xB9DE;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;/&#xD2C0;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;/&#xC2DC;&#xAC04; &#xCD08;&#xACFC;/&#xCEF4;&#xD30C;&#xC77C; &#xC5D0;&#xB7EC; &#xB4F1;&#xC758; &#xCC44;&#xC810; &#xACB0;&#xACFC;&#xB97C; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC774; &#xB54C; &#xCEF4;&#xD30C;&#xC77C; &#xC5D0;&#xB7EC;&#xC758; &#xACBD;&#xC6B0;, &#xCEF4;&#xD30C;&#xC77C; &#xC5D0;&#xB7EC;&#xB77C;&#xACE0; &#xC801;&#xD78C; &#xBD80;&#xBD84;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xBB34;&#xC2A8; &#xC774;&#xC720;&#xB85C; &#xCEF4;&#xD30C;&#xC77C; &#xC5D0;&#xB7EC;&#xAC00; &#xB0AC;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC31;&#xC900; &#xC0AC;&#xC774;&#xD2B8; &#xC0C1;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; C++ &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; gcc&#xC778;&#xB370;, &#xC790;&#xC2E0;&#xC774; C++ &#xCF54;&#xB529;&#xC744; &#xD558;&#xB294; &#xD658;&#xACBD;&#xC774; visual studio&#xB4F1; &#xB2E4;&#xB978; &#xD658;&#xACBD;&#xC774;&#xB77C;&#xBA74; &#xC790;&#xC2E0;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C;&#xB294; &#xCEF4;&#xD30C;&#xC77C;&#xC774; &#xB418;&#xB294;&#xB370; &#xC81C;&#xCD9C;&#xC2DC;&#xC5D0;&#xB294; &#xCEF4;&#xD30C;&#xC77C;&#xC774; &#xC548; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F4; &#xB54C;&#xB294; &#xAF2D; &#xBB34;&#xC5C7; &#xB54C;&#xBB38;&#xC5D0; &#xCEF4;&#xD30C;&#xC77C; &#xC5D0;&#xB7EC;&#xAC00; &#xB0AC;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD569;&#xC2DC;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="소개.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 소개">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"온라인 저지","level":"1.2.1","depth":2,"previous":{"title":"소개","level":"1.2","depth":1,"path":"posts/소개.md","ref":"posts/소개.md","articles":[{"title":"온라인 저지","level":"1.2.1","depth":2,"path":"posts/온라인 저지.md","ref":"posts/온라인 저지.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["mathjax","collapse","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"collapse":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"gitbook":"*"},"file":{"path":"posts/온라인 저지.md","mtime":"2018-11-04T15:59:21.112Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-11-04T15:51:33.720Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-collapse/collapse.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

